/**
 * x:[96,352)
 * y:[96,352)
 * z:[96,352)
 * の256*256*256ブロック=8*8*8チャンク=512チャンク
 */
export const ENCODE_DATA_POS = {
  pos1: [32 * 3, 32 * 3, 32 * 3],
  pos2: [32 * 11, 32 * 11, 32 * 11],
} as const;
/**
 * x:[352,608)
 * y:[96,352)
 * z:[96,352)
 * の256*256*256ブロック=8*8*8チャンク=512チャンク
 */
export const DECODE_DATA_POS = {
  pos1: [32 * 11, 32 * 3, 32 * 3],
  pos2: [32 * 19, 32 * 11, 32 * 11],
} as const;
/**
 * x:[608,864)
 * y:[96,352)
 * z:[96,352)
 * の256*256*256ブロック=8*8*8チャンク=512チャンク
 */
export const MERGE_DATA_POS = {
  pos1: [32 * 19, 32 * 3, 32 * 3],
  pos2: [32 * 27, 32 * 11, 32 * 11],
} as const;
