/**
 * x:[96,224)
 * y:[96,224)
 * z:[96,224)
 * の128*128*128ブロック=4*4*4チャンク=64チャンク
 */
export const ENCODE_DATA_POS = {
  pos1: [32 * 3, 32 * 3, 32 * 3],
  pos2: [32 * 7, 32 * 7, 32 * 7],
};
/**
 * x:[224,352)
 * y:[96,224)
 * z:[96,224)
 * の128*128*128ブロック=4*4*4チャンク=64チャンク
 */
export const DECODE_DATA_POS = {
  pos1: [32 * 7, 32 * 3, 32 * 3],
  pos2: [32 * 11, 32 * 7, 32 * 7],
};
/**
 * x:[352,448)
 * y:[96,224)
 * z:[96,224)
 * の128*128*128ブロック=4*4*4チャンク=64チャンク
 */
export const MERGE_DATA_POS = {
  pos1: [32 * 11, 32 * 3, 32 * 3],
  pos2: [32 * 14, 32 * 7, 32 * 7],
};
